espressif/esp-idf/components/soc/esp32s2/register/soc/gpio_reg.h
#define GPIO_PIN43_REG          (DR_REG_GPIO_BASE + 0x120)
/* GPIO_PIN43_INT_ENA : R/W ;bitpos:[17:13] ;default: 5'h0 ; */
/*description: */
#define GPIO_PIN43_INT_ENA  0x0000001F
#define GPIO_PIN43_INT_ENA_M  ((GPIO_PIN43_INT_ENA_V)<<(GPIO_PIN43_INT_ENA_S))
#define GPIO_PIN43_INT_ENA_V  0x1F
#define GPIO_PIN43_INT_ENA_S  13
/* GPIO_PIN43_CONFIG : R/W ;bitpos:[12:11] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN43_CONFIG  0x00000003
#define GPIO_PIN43_CONFIG_M  ((GPIO_PIN43_CONFIG_V)<<(GPIO_PIN43_CONFIG_S))
#define GPIO_PIN43_CONFIG_V  0x3
#define GPIO_PIN43_CONFIG_S  11
/* GPIO_PIN43_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN43_WAKEUP_ENABLE  (BIT(10))
#define GPIO_PIN43_WAKEUP_ENABLE_M  (BIT(10))
#define GPIO_PIN43_WAKEUP_ENABLE_V  0x1
#define GPIO_PIN43_WAKEUP_ENABLE_S  10
/* GPIO_PIN43_INT_TYPE : R/W ;bitpos:[9:7] ;default: 3'h0 ; */
/*description: */
#define GPIO_PIN43_INT_TYPE  0x00000007
#define GPIO_PIN43_INT_TYPE_M  ((GPIO_PIN43_INT_TYPE_V)<<(GPIO_PIN43_INT_TYPE_S))
#define GPIO_PIN43_INT_TYPE_V  0x7
#define GPIO_PIN43_INT_TYPE_S  7
/* GPIO_PIN43_SYNC1_BYPASS : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN43_SYNC1_BYPASS  0x00000003
#define GPIO_PIN43_SYNC1_BYPASS_M  ((GPIO_PIN43_SYNC1_BYPASS_V)<<(GPIO_PIN43_SYNC1_BYPASS_S))
#define GPIO_PIN43_SYNC1_BYPASS_V  0x3
#define GPIO_PIN43_SYNC1_BYPASS_S  3
/* GPIO_PIN43_PAD_DRIVER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN43_PAD_DRIVER  (BIT(2))
#define GPIO_PIN43_PAD_DRIVER_M  (BIT(2))
#define GPIO_PIN43_PAD_DRIVER_V  0x1
#define GPIO_PIN43_PAD_DRIVER_S  2
/* GPIO_PIN43_SYNC2_BYPASS : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN43_SYNC2_BYPASS  0x00000003
#define GPIO_PIN43_SYNC2_BYPASS_M  ((GPIO_PIN43_SYNC2_BYPASS_V)<<(GPIO_PIN43_SYNC2_BYPASS_S))
#define GPIO_PIN43_SYNC2_BYPASS_V  0x3
#define GPIO_PIN43_SYNC2_BYPASS_S  0

#define GPIO_PIN44_REG          (DR_REG_GPIO_BASE + 0x124)
/* GPIO_PIN44_INT_ENA : R/W ;bitpos:[17:13] ;default: 5'h0 ; */
/*description: */
#define GPIO_PIN44_INT_ENA  0x0000001F
#define GPIO_PIN44_INT_ENA_M  ((GPIO_PIN44_INT_ENA_V)<<(GPIO_PIN44_INT_ENA_S))
#define GPIO_PIN44_INT_ENA_V  0x1F
#define GPIO_PIN44_INT_ENA_S  13
/* GPIO_PIN44_CONFIG : R/W ;bitpos:[12:11] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN44_CONFIG  0x00000003
#define GPIO_PIN44_CONFIG_M  ((GPIO_PIN44_CONFIG_V)<<(GPIO_PIN44_CONFIG_S))
#define GPIO_PIN44_CONFIG_V  0x3
#define GPIO_PIN44_CONFIG_S  11
/* GPIO_PIN44_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN44_WAKEUP_ENABLE  (BIT(10))
#define GPIO_PIN44_WAKEUP_ENABLE_M  (BIT(10))
#define GPIO_PIN44_WAKEUP_ENABLE_V  0x1
#define GPIO_PIN44_WAKEUP_ENABLE_S  10
/* GPIO_PIN44_INT_TYPE : R/W ;bitpos:[9:7] ;default: 3'h0 ; */
/*description: */
#define GPIO_PIN44_INT_TYPE  0x00000007
#define GPIO_PIN44_INT_TYPE_M  ((GPIO_PIN44_INT_TYPE_V)<<(GPIO_PIN44_INT_TYPE_S))
#define GPIO_PIN44_INT_TYPE_V  0x7
#define GPIO_PIN44_INT_TYPE_S  7
/* GPIO_PIN44_SYNC1_BYPASS : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN44_SYNC1_BYPASS  0x00000003
#define GPIO_PIN44_SYNC1_BYPASS_M  ((GPIO_PIN44_SYNC1_BYPASS_V)<<(GPIO_PIN44_SYNC1_BYPASS_S))
#define GPIO_PIN44_SYNC1_BYPASS_V  0x3
#define GPIO_PIN44_SYNC1_BYPASS_S  3
/* GPIO_PIN44_PAD_DRIVER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN44_PAD_DRIVER  (BIT(2))
#define GPIO_PIN44_PAD_DRIVER_M  (BIT(2))
#define GPIO_PIN44_PAD_DRIVER_V  0x1
#define GPIO_PIN44_PAD_DRIVER_S  2
/* GPIO_PIN44_SYNC2_BYPASS : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN44_SYNC2_BYPASS  0x00000003
#define GPIO_PIN44_SYNC2_BYPASS_M  ((GPIO_PIN44_SYNC2_BYPASS_V)<<(GPIO_PIN44_SYNC2_BYPASS_S))
#define GPIO_PIN44_SYNC2_BYPASS_V  0x3
#define GPIO_PIN44_SYNC2_BYPASS_S  0

#define GPIO_PIN45_REG          (DR_REG_GPIO_BASE + 0x128)
/* GPIO_PIN45_INT_ENA : R/W ;bitpos:[17:13] ;default: 5'h0 ; */
/*description: */
#define GPIO_PIN45_INT_ENA  0x0000001F
#define GPIO_PIN45_INT_ENA_M  ((GPIO_PIN45_INT_ENA_V)<<(GPIO_PIN45_INT_ENA_S))
#define GPIO_PIN45_INT_ENA_V  0x1F
#define GPIO_PIN45_INT_ENA_S  13
/* GPIO_PIN45_CONFIG : R/W ;bitpos:[12:11] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN45_CONFIG  0x00000003
#define GPIO_PIN45_CONFIG_M  ((GPIO_PIN45_CONFIG_V)<<(GPIO_PIN45_CONFIG_S))
#define GPIO_PIN45_CONFIG_V  0x3
#define GPIO_PIN45_CONFIG_S  11
/* GPIO_PIN45_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN45_WAKEUP_ENABLE  (BIT(10))
#define GPIO_PIN45_WAKEUP_ENABLE_M  (BIT(10))
#define GPIO_PIN45_WAKEUP_ENABLE_V  0x1
#define GPIO_PIN45_WAKEUP_ENABLE_S  10
/* GPIO_PIN45_INT_TYPE : R/W ;bitpos:[9:7] ;default: 3'h0 ; */
/*description: */
#define GPIO_PIN45_INT_TYPE  0x00000007
#define GPIO_PIN45_INT_TYPE_M  ((GPIO_PIN45_INT_TYPE_V)<<(GPIO_PIN45_INT_TYPE_S))
#define GPIO_PIN45_INT_TYPE_V  0x7
#define GPIO_PIN45_INT_TYPE_S  7
/* GPIO_PIN45_SYNC1_BYPASS : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN45_SYNC1_BYPASS  0x00000003
#define GPIO_PIN45_SYNC1_BYPASS_M  ((GPIO_PIN45_SYNC1_BYPASS_V)<<(GPIO_PIN45_SYNC1_BYPASS_S))
#define GPIO_PIN45_SYNC1_BYPASS_V  0x3
#define GPIO_PIN45_SYNC1_BYPASS_S  3
/* GPIO_PIN45_PAD_DRIVER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN45_PAD_DRIVER  (BIT(2))
#define GPIO_PIN45_PAD_DRIVER_M  (BIT(2))
#define GPIO_PIN45_PAD_DRIVER_V  0x1
#define GPIO_PIN45_PAD_DRIVER_S  2
/* GPIO_PIN45_SYNC2_BYPASS : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN45_SYNC2_BYPASS  0x00000003
#define GPIO_PIN45_SYNC2_BYPASS_M  ((GPIO_PIN45_SYNC2_BYPASS_V)<<(GPIO_PIN45_SYNC2_BYPASS_S))
#define GPIO_PIN45_SYNC2_BYPASS_V  0x3
#define GPIO_PIN45_SYNC2_BYPASS_S  0

#define GPIO_PIN46_REG          (DR_REG_GPIO_BASE + 0x12C)
/* GPIO_PIN46_INT_ENA : R/W ;bitpos:[17:13] ;default: 5'h0 ; */
/*description: */
#define GPIO_PIN46_INT_ENA  0x0000001F
#define GPIO_PIN46_INT_ENA_M  ((GPIO_PIN46_INT_ENA_V)<<(GPIO_PIN46_INT_ENA_S))
#define GPIO_PIN46_INT_ENA_V  0x1F
#define GPIO_PIN46_INT_ENA_S  13
/* GPIO_PIN46_CONFIG : R/W ;bitpos:[12:11] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN46_CONFIG  0x00000003
#define GPIO_PIN46_CONFIG_M  ((GPIO_PIN46_CONFIG_V)<<(GPIO_PIN46_CONFIG_S))
#define GPIO_PIN46_CONFIG_V  0x3
#define GPIO_PIN46_CONFIG_S  11
/* GPIO_PIN46_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN46_WAKEUP_ENABLE  (BIT(10))
#define GPIO_PIN46_WAKEUP_ENABLE_M  (BIT(10))
#define GPIO_PIN46_WAKEUP_ENABLE_V  0x1
#define GPIO_PIN46_WAKEUP_ENABLE_S  10
/* GPIO_PIN46_INT_TYPE : R/W ;bitpos:[9:7] ;default: 3'h0 ; */
/*description: */
#define GPIO_PIN46_INT_TYPE  0x00000007
#define GPIO_PIN46_INT_TYPE_M  ((GPIO_PIN46_INT_TYPE_V)<<(GPIO_PIN46_INT_TYPE_S))
#define GPIO_PIN46_INT_TYPE_V  0x7
#define GPIO_PIN46_INT_TYPE_S  7
/* GPIO_PIN46_SYNC1_BYPASS : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN46_SYNC1_BYPASS  0x00000003
#define GPIO_PIN46_SYNC1_BYPASS_M  ((GPIO_PIN46_SYNC1_BYPASS_V)<<(GPIO_PIN46_SYNC1_BYPASS_S))
#define GPIO_PIN46_SYNC1_BYPASS_V  0x3
#define GPIO_PIN46_SYNC1_BYPASS_S  3
/* GPIO_PIN46_PAD_DRIVER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN46_PAD_DRIVER  (BIT(2))
#define GPIO_PIN46_PAD_DRIVER_M  (BIT(2))
#define GPIO_PIN46_PAD_DRIVER_V  0x1
#define GPIO_PIN46_PAD_DRIVER_S  2
/* GPIO_PIN46_SYNC2_BYPASS : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN46_SYNC2_BYPASS  0x00000003
#define GPIO_PIN46_SYNC2_BYPASS_M  ((GPIO_PIN46_SYNC2_BYPASS_V)<<(GPIO_PIN46_SYNC2_BYPASS_S))
#define GPIO_PIN46_SYNC2_BYPASS_V  0x3
#define GPIO_PIN46_SYNC2_BYPASS_S  0

#define GPIO_PIN47_REG          (DR_REG_GPIO_BASE + 0x130)
/* GPIO_PIN47_INT_ENA : R/W ;bitpos:[17:13] ;default: 5'h0 ; */
/*description: */
#define GPIO_PIN47_INT_ENA  0x0000001F
#define GPIO_PIN47_INT_ENA_M  ((GPIO_PIN47_INT_ENA_V)<<(GPIO_PIN47_INT_ENA_S))
#define GPIO_PIN47_INT_ENA_V  0x1F
#define GPIO_PIN47_INT_ENA_S  13
/* GPIO_PIN47_CONFIG : R/W ;bitpos:[12:11] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN47_CONFIG  0x00000003
#define GPIO_PIN47_CONFIG_M  ((GPIO_PIN47_CONFIG_V)<<(GPIO_PIN47_CONFIG_S))
#define GPIO_PIN47_CONFIG_V  0x3
#define GPIO_PIN47_CONFIG_S  11
/* GPIO_PIN47_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN47_WAKEUP_ENABLE  (BIT(10))
#define GPIO_PIN47_WAKEUP_ENABLE_M  (BIT(10))
#define GPIO_PIN47_WAKEUP_ENABLE_V  0x1
#define GPIO_PIN47_WAKEUP_ENABLE_S  10
/* GPIO_PIN47_INT_TYPE : R/W ;bitpos:[9:7] ;default: 3'h0 ; */
/*description: */
#define GPIO_PIN47_INT_TYPE  0x00000007
#define GPIO_PIN47_INT_TYPE_M  ((GPIO_PIN47_INT_TYPE_V)<<(GPIO_PIN47_INT_TYPE_S))
#define GPIO_PIN47_INT_TYPE_V  0x7
#define GPIO_PIN47_INT_TYPE_S  7
/* GPIO_PIN47_SYNC1_BYPASS : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN47_SYNC1_BYPASS  0x00000003
#define GPIO_PIN47_SYNC1_BYPASS_M  ((GPIO_PIN47_SYNC1_BYPASS_V)<<(GPIO_PIN47_SYNC1_BYPASS_S))
#define GPIO_PIN47_SYNC1_BYPASS_V  0x3
#define GPIO_PIN47_SYNC1_BYPASS_S  3
/* GPIO_PIN47_PAD_DRIVER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN47_PAD_DRIVER  (BIT(2))
#define GPIO_PIN47_PAD_DRIVER_M  (BIT(2))
#define GPIO_PIN47_PAD_DRIVER_V  0x1
#define GPIO_PIN47_PAD_DRIVER_S  2
/* GPIO_PIN47_SYNC2_BYPASS : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN47_SYNC2_BYPASS  0x00000003
#define GPIO_PIN47_SYNC2_BYPASS_M  ((GPIO_PIN47_SYNC2_BYPASS_V)<<(GPIO_PIN47_SYNC2_BYPASS_S))
#define GPIO_PIN47_SYNC2_BYPASS_V  0x3
#define GPIO_PIN47_SYNC2_BYPASS_S  0

#define GPIO_PIN48_REG          (DR_REG_GPIO_BASE + 0x134)
/* GPIO_PIN48_INT_ENA : R/W ;bitpos:[17:13] ;default: 5'h0 ; */
/*description: */
#define GPIO_PIN48_INT_ENA  0x0000001F
#define GPIO_PIN48_INT_ENA_M  ((GPIO_PIN48_INT_ENA_V)<<(GPIO_PIN48_INT_ENA_S))
#define GPIO_PIN48_INT_ENA_V  0x1F
#define GPIO_PIN48_INT_ENA_S  13
/* GPIO_PIN48_CONFIG : R/W ;bitpos:[12:11] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN48_CONFIG  0x00000003
#define GPIO_PIN48_CONFIG_M  ((GPIO_PIN48_CONFIG_V)<<(GPIO_PIN48_CONFIG_S))
#define GPIO_PIN48_CONFIG_V  0x3
#define GPIO_PIN48_CONFIG_S  11
/* GPIO_PIN48_WAKEUP_ENABLE : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN48_WAKEUP_ENABLE  (BIT(10))
#define GPIO_PIN48_WAKEUP_ENABLE_M  (BIT(10))
#define GPIO_PIN48_WAKEUP_ENABLE_V  0x1
#define GPIO_PIN48_WAKEUP_ENABLE_S  10
/* GPIO_PIN48_INT_TYPE : R/W ;bitpos:[9:7] ;default: 3'h0 ; */
/*description: */
#define GPIO_PIN48_INT_TYPE  0x00000007
#define GPIO_PIN48_INT_TYPE_M  ((GPIO_PIN48_INT_TYPE_V)<<(GPIO_PIN48_INT_TYPE_S))
#define GPIO_PIN48_INT_TYPE_V  0x7
#define GPIO_PIN48_INT_TYPE_S  7
/* GPIO_PIN48_SYNC1_BYPASS : R/W ;bitpos:[4:3] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN48_SYNC1_BYPASS  0x00000003
#define GPIO_PIN48_SYNC1_BYPASS_M  ((GPIO_PIN48_SYNC1_BYPASS_V)<<(GPIO_PIN48_SYNC1_BYPASS_S))
#define GPIO_PIN48_SYNC1_BYPASS_V  0x3
#define GPIO_PIN48_SYNC1_BYPASS_S  3
/* GPIO_PIN48_PAD_DRIVER : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: */
#define GPIO_PIN48_PAD_DRIVER  (BIT(2))
#define GPIO_PIN48_PAD_DRIVER_M  (BIT(2))
#define GPIO_PIN48_PAD_DRIVER_V  0x1
#define GPIO_PIN48_PAD_DRIVER_S  2
/* GPIO_PIN48_SYNC2_BYPASS : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: */
#define GPIO_PIN48_SYNC2_BYPASS  0x00000003
#define GPIO_PIN48_SYNC2_BYPASS_M  ((GPIO_PIN48_SYNC2_BYPASS_V)<<(GPIO_PIN48_SYNC2_BYPASS_S))
#define GPIO_PIN48_SYNC2_BYPASS_V  0x3
#define GPIO_PIN48_SYNC2_BYPASS_S  0

